# Задача 3. На соревновании по биатлону один из трех спортсменов стреляет и попадает в мишень.
# Вероятность попадания для первого спортсмена равна 0.9, для второго — 0.8, для третьего — 0.6.
# Найти вероятность того, что выстрел произведен: a). первым спортсменом б). вторым спортсменом в). третьим спортсменом.

print('Вероятность того, что попадёт первый - 39.12%\nВероятность того, что попадёт второй - 34.78%\nВероятность того, что попадёт третий - 26.1%')