# Задача 4. В университет на факультеты A и B поступило равное количество студентов, а на факультет C
# студентов поступило столько же, сколько на A и B вместе. Вероятность того, что студент факультета A
# сдаст первую сессию, равна 0.8. Для студента факультета B эта вероятность равна 0.7, а для студента
# факультета C - 0.9. Студент сдал первую сессию.
# Какова вероятность, что он учится: a). на факультете A б). на факультете B в). на факультете C?

print('Вероятность того, что он учится на первом факультете - 24.24%\nВероятность того, что он учится на втором факультете - 21.21%\nВероятность того, что он учится на третьем факультете - 54.55%')
